<!--
 * @Author: Coan
 * @Date: 2022-08-22 10:48:42
 * @LastEditors: Coan
 * @LastEditTime: 2022-08-22 14:55:41
 * @FilePath: /nme/src/views/rule.vue
 * @Description:
-->
<template>
  <div class="mainWarp">
    <Info />
    <div class="ruleWarp">
      <h4>考生须知</h4>
      <div>
        1.考生进入考室后，须在《签到表》上签字，对号入座后将本人《准考证》、有效身份证明放在课桌右上角，以便核验。<br />
        2.开考前15分钟，考生可按准考证号和身份证号信息登录考试系统（证件输入应注意括号和大小写），核对并确认基本信息无误后，进入考试规则和考生承诺界面，仔细阅读相关文件并确认后，等待考试开始。<br />
        3.考生进入考试系统后，应注意考试界面的左侧显示的开始时间、结束时间和剩余时间，考试过程中把控好考试时间。完成并提交答题信息前，应注意考试界面左侧的答题提示，确认没有未答题。<br />
        4.提前结束答题的考生，可点击“完成考试”按钮。<br />
        5.考试结束后，系统将自动提示“时间到，考试结束”，未完成的考生将不能继续答题。<br />
        6.监考员离场指令发出后，考生方可离场。
      </div>
      <h4>考试规则</h4>
      <div>
        1.考生入场除准考证、有效身份证明、签字笔和计算器外，禁止携带任何书籍、纸张、手表、手机等各种无线通讯工具以及一切与考试无关但有作弊嫌疑的物品。如违规带入，必须立即主动上交，可以免于考试违规处罚。<br />
        2.开考30分钟后考生不得进入考室。考试期间考生不得离开考室，在考试规定时间前完成答题或要求提前结束考试的考生，须按考试工作人员要求，在警戒线区域内指定地点等待，考试结束后方能离开。等待期间不得使用通讯工具。<br />
        3.考生不得要求监考员解释试题，如遇计算机系统问题，可举手询问。外籍或台湾、香港、澳门考生进入考场后，必须使用中文普通话。<br />
        4.考生在考场内必须保持安静，不准交头接耳、左顾右盼；不准偷窥；不准吸烟。<br />
        5.考生应自觉服从监考员管理，不得以任何理由妨碍监考员进行正常工作。对违反《考试规则》、考试纪律，不服从监考员管理的违规考生，将依据《医师资格考试违纪违规处理规定》进行处理。
      </div>
      <h4>考生承诺</h4>
      <div>
        我是报考参加计算机化考试的考生，我已阅读并知悉了《考试规则》、《医师资格考试违纪违规处理规定》等医师资格考试相关文件和规定。经认真考虑，郑重承诺以下事项：<br />
        　　1.自觉服从考试组织管理部门的统一安排，接受监考人员的检查、监督和管理。<br />
        　　2. 保证在考试过程中遵纪守法、诚实守信。<br />
        　　如违反上述承诺，自愿按相关规定接受处罚，并愿意承担由此而引起的一切后果。
      </div>
      <div>我已经仔细阅读以上承诺并确认同意。</div>
      <button @click="next" style="margin: 20px auto; display: block">
        确认
      </button>
    </div>
  </div>
</template>

<script setup lang="ts">
import Info from '../components/info.vue';
import bus from '../utils/bus';

function next() {
  bus.emit('next');
}
</script>

<style scoped>
.ruleWarp {
  flex: 1;
  text-align: center;
  text-align: left;
}
</style>
